* ps + grep                                                              :PS:
ps + grep  Not to report itself in a process search
#+BEGIN_SRC sh
ps afx | grep emacs | grep -v grep
#+END_SRC

#+RESULTS:
: 2504 ?        Sl     0:30 emacs
** TODO reptry pid.
   [2015-11-27 শুক্র]

* Filesystem
** Mount Remote
*** https://wiki.archlinux.org/index.php/Sshfs
* USB
*** USB
**** USB RESET
***** Code 1 [[https://forums.gentoo.org/viewtopic-p-6378527.html][ref1]] [[http://marc.info/?l=linux-usb-users&m=116827193506484&w=2][ref2]]
****** Command
******* Bus Number, Device Number for Huawei Modem
#+BEGIN_SRC sh
lsusb | grep -h Huawei
#+END_SRC

#+RESULTS:
******* Reset
#+BEGIN_SRC sh :dir /sudo::
#ls -l
/home/rks/org/usb/usbreset /dev/bus/usb/001/014
#+END_SRC

#+RESULTS:


****** Dependency
#+BEGIN_SRC sh :dir /sudo::
apt-get install libusb-dev -y
#+END_SRC

#+RESULTS:
| Reading    | package    | lists...               | 0%\n\nReading                                   | package     | lists...                   | 100%\n\nReading | package    | lists...                   | Done            |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Building   | dependency | tree...                | 0%\n\nBuilding                                  | dependency  | tree...                    | 0%\n\nBuilding  | dependency | tree...                    | 50%\n\nBuilding | dependency | tree...                | 50%\n\nBuilding | dependency | tree |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Reading    | state      | information...         | 0%\n\nReading                                   | state       | information...             | 0%\n\nReading   | state      | information...             | Done            |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| The        | following  | NEW                    | packages                                        | will        | be                         | installed:      |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| libusb-dev |            |                        |                                                 |             |                            |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| 0          | upgraded,  | 1                      | newly                                           | installed,  | 0                          | to              | remove     | and                        | 8               | not        | upgraded.              |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Need       | to         | get                    | 28.9                                            | kB          | of                         | archives.       |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| After      | this       | operation,             | 251                                             | kB          | of                         | additional      | disk       | space                      | will            | be         | used.                  |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| 0%         | [Working]  | 0%                     | [Connecting                                     | to          | uk.archive.ubuntu.com]\n0% | [Connecting     | to         | uk.archive.ubuntu.com]\n0% | [Connecting     | to         | uk.archive.ubuntu.com] | 0%              | [Waiting   | for  | headers]      | Get:1     | http://uk.archive.ubuntu.com/ubuntu/ | trusty/main   | libusb-dev | amd64 | 2:0.1.12-23.3ubuntu1 | [28.9    | kB]  |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
|            | 0%         | [1                     | libusb-dev                                      | 0           | B/28.9                     | kB              | 0%]        | 61%                        | [1              | libusb-dev | 17.5                   | kB/28.9         | kB         | 61%] | 100%          | [Working] | Fetched                              | 28.9          | kB         | in    | 2s                   | (9,922   | B/s) |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Selecting  | previously | unselected             | package                                         | libusb-dev. |                            |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| (Reading   | database   | ...                    | (Reading                                        | database    | ...                        | 5%\n(Reading    | database   | ...                        | 10%\n(Reading   | database   | ...                    | 15%\n(Reading   | database   | ...  | 20%\n(Reading | database  | ...                                  | 25%\n(Reading | database   | ...   | 30%\n(Reading        | database | ...  | 35%\n(Reading | database | ... | 40%\n(Reading | database | ... | 45%\n(Reading | database | ... | 50%\n(Reading | database | ... | 55%\n(Reading | database | ... | 60%\n(Reading | database | ... | 65%\n(Reading | database | ... | 70%\n(Reading | database | ... | 75%\n(Reading | database | ... | 80%\n(Reading | database | ... | 85%\n(Reading | database | ... | 90%\n(Reading | database | ... | 95%\n(Reading | database | ... | 100%\n(Reading | database | ... | 206954 | files | and | directories | currently | installed.) |
| Preparing  | to         | unpack                 | .../libusb-dev_2%3a0.1.12-23.3ubuntu1_amd64.deb | ...         |                            |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Unpacking  | libusb-dev | (2:0.1.12-23.3ubuntu1) | ...                                             |             |                            |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Processing | triggers   | for                    | man-db                                          | (2.6.7.1-1) | ...                        |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| debconf:   | unable     | to                     | initialize                                      | frontend:   | Dialog                     |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| debconf:   | (Dialog    | frontend               | will                                            | not         | work                       | on              | a          | dumb                       | terminal,       | an         | emacs                  | shell           | buffer,    | or   | without       | a         | controlling                          | terminal.)    |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| debconf:   | falling    | back                   | to                                              | frontend:   | Readline                   |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Processing | triggers   | for                    | doc-base                                        | (0.10.5)    | ...                        |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Processing | 1          | added                  | doc-base                                        | file...     |                            |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
| Setting    | up         | libusb-dev             | (2:0.1.12-23.3ubuntu1)                          | ...         |                            |                 |            |                            |                 |            |                        |                 |            |      |               |           |                                      |               |            |       |                      |          |      |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |               |          |     |                |          |     |        |       |     |             |           |             |
****** Code
#+BEGIN_SRC c :tangle usb/usbreset.c
/* usbreset -- send a USB port reset to a USB device */
#include <stdio.h>
#include <unistd.h>
#include <fcntl.h>
#include <errno.h>

#include <sys/ioctl.h>

#include <linux/usbdevice_fs.h>


int main(int argc, char **argv)
{
	const char *filename;
	int fd;
	int rc;

	if (argc != 2) {
		fprintf(stderr, "Usage: usbreset device-filename\n");
		return 1;
	}
	filename = argv[1];

	fd = open(filename, O_WRONLY);
	if (fd < 0) {
		perror("Error opening output file");
		return 1;
	}

	printf("Resetting USB device %s\n", filename);
	rc = ioctl(fd, USBDEVFS_RESET, 0);
	if (rc < 0) {
		perror("Error in ioctl");
		return 1;
	}
	printf("Reset successful\n");

	close(fd);
	return 0;
}
#+END_SRC
****** Compile
#+BEGIN_SRC sh :dir usb
gcc -o usbreset usbreset.c -lusb
#+END_SRC

#+RESULTS:

***** Code 2
To compile use: gcc -o outputname resetusb.c -lusb
#+BEGIN_SRC c
#include <stdio.h>
#include <usb.h>

int main(void)
{
      struct usb_bus *busses;
      usb_init();
      usb_find_busses();
      usb_find_devices();
      busses = usb_get_busses();
      struct usb_bus *bus;
      int c, i, a;
      /* ... */
      for (bus = busses; bus; bus = bus->next) {
        struct usb_device *dev;
        int val;
        usb_dev_handle *junk;
        for (dev = bus->devices; dev; dev = dev->next) {
          char buf[1024];
          junk = usb_open ( dev );
          usb_get_string_simple(junk,2,buf,1023);
          if ( junk == NULL ){
            printf("Can't open %p (%s)\n", dev, buf );
          } else {
            val = usb_reset(junk);
            printf( "reset %p %d (%s)\n", dev, val, buf );
          }
          usb_close(junk);
        }
      }
}
#+END_SRC


command: gcc -o outputname resetusb.c -lusb
***** Command
#+BEGIN_SRC sh
udevadm trigger --action=add
#+END_SRC

***** Kernel parameter
you have to enable the following within the kernel config
CONFIG_USB_EHCI_TT_NEWSCHED=y
*** USB 3G Modem
**** SMS
***** [[http://www.pcbackup.it/asterisk-chan-dongle-sms-memory-dongle-full/][ASTERISK CHAN DONGLE SMS MEMORY DONGLE FULL]]
using massivley our sms booster can happened to receive on asterisk CLI the sms memory full even if you have set the
autodeletesms=yes in [general] section of dongle.conf
Sometimes modem receive SMS and store in SIM storage.
So ‘+CMTI: “SM”,1′ reported by modem to chan_dongle.

But chan_dongle can use only “ME” (dongle) storage for read and delete messages, and do commands:
AT+CMGR=1 AT+CMGD=1 for “ME” (because issue AT+CPMS=”ME”,”ME”,”ME” at initialize time)

Both command shortly report OK,
but (second bug) OK in responce of AT+CMGR handled wrong and does’t trigger incoming_sms state back

causes two troubles

1) persistent “SMS” state

2) SM storage report ^SMMEMFULL when full

so i create a script according to http://wiki.e1550.mobi/doku.php?id=troubleshooting

to delete sms from both sim and dongle memory and plced it to /etc/cron.daily

like this:
#+BEGIN_SRC sh :dir /sudo::
asterisk -rx 'dongle cmd dongle0 AT+CPMS=\"SM\",\"SM\",\"SM\"'
sleep1
asterisk -rx 'dongle cmd dongle0 AT+CMGD=1,4'
sleep 1
asterisk -rx 'dongle cmd dongle0 AT+CPMS=\"ME\",\"ME\",\"ME\"'
sleep 1
asterisk -rx 'dongle cmd dongle0 AT+CMGD=1,4'
#+END_SRC

#+RESULTS:
| SM                   | SM                            | SM' Command queued for execute |
| [dongle0] 'AT+CMGD=1 | 4' Command queued for execute |                                |
| ME                   | ME                            | ME' Command queued for execute |
| [dongle0] 'AT+CMGD=1 | 4' Command queued for execute |                                |

***** Install Gnokii
#+BEGIN_SRC sh :dir /sudo::
apt-get install gnokii -y
#+END_SRC

#+RESULTS:
| Reading    | package                                 | lists...               | 0%\n\nReading                                  | package                         | lists...       | 100%\n\nReading | package                              | lists...        | Done            |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Building   | dependency                              | tree...                | 0%\n\nBuilding                                 | dependency                      | tree...        | 0%\n\nBuilding  | dependency                           | tree...         | 50%\n\nBuilding | dependency    | tree...              | 50%\n\nBuilding | dependency | tree     |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Reading    | state                                   | information...         | 0%\n\nReading                                  | state                           | information... | 0%\n\nReading   | state                                | information...  | Done            |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| The        | following                               | extra                  | packages                                       | will                            | be             | installed:      |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| gnokii-cli | gnokii-common                           | libgnokii7             | xgnokii                                        |                                 |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| The        | following                               | NEW                    | packages                                       | will                            | be             | installed:      |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| gnokii     | gnokii-cli                              | gnokii-common          | libgnokii7                                     | xgnokii                         |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| 0          | upgraded,                               | 5                      | newly                                          | installed,                      | 0              | to              | remove                               | and             | 8               | not           | upgraded.            |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Need       | to                                      | get                    | 851                                            | kB                              | of             | archives.       |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| After      | this                                    | operation,             | 2,350                                          | kB                              | of             | additional      | disk                                 | space           | will            | be            | used.                |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| 0%         | [Working]                               | 0%                     | [Waiting                                       | for                             | headers]       | Get:1           | http://uk.archive.ubuntu.com/ubuntu/ | trusty/universe | gnokii-common   | all           | 0.6.31+dfsg-2ubuntu1 | [121            | kB]        |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
|            | 0%                                      | [1                     | gnokii-common                                  | 0                               | B/121          | kB              | 0%]                                  | 3%              | [1              | gnokii-common | 29.4                 | kB/121          | kB         | 24%]\n6% | [1            | gnokii-common | 52.1        | kB/121        | kB       | 43%]\n6%   | [1            | gnokii-common | 53.1 | kB/121        |       kB | 44%]\n6% | [1            | gnokii-common | 53.1       | kB/121        | kB       | 44%]   | 14%           | [Working] | Get:2 | http://uk.archive.ubuntu.com/ubuntu/ | trusty/universe | libgnokii7 | amd64         | 0.6.31+dfsg-2ubuntu1 | [283 | kB]           |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
|            | 14%                                     | [2                     | libgnokii7                                     | 0                               | B/283          | kB              | 0%]                                  | 16%             | [2              | libgnokii7    | 18.5                 | kB/283          | kB         | 7%]      | 23%           | [2            | libgnokii7  | 73.8          | kB/283   | kB         | 26%]          | 27%           | [2   | libgnokii7    |      112 | kB/283   | kB            | 40%]\n35%     | [2         | libgnokii7    | 177      | kB/283 | kB            | 62%]      | 42%   | [2                                   | libgnokii7      | 234        | kB/283        | kB                   | 83%] | 58.7          |     kB/s | 8s\n47% | [Working]     | 58.7      | kB/s       | 7s            | Get:3    | http://uk.archive.ubuntu.com/ubuntu/ | trusty/universe                      | gnokii-cli      | amd64  | 0.6.31+dfsg-2ubuntu1 | [296                 | kB]        |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| 47%        | [3                                      | gnokii-cli             | 0                                              | B/296                           | kB             | 0%]             | 58.7                                 | kB/s            | 7s\n50%         | [3            | gnokii-cli           | 18.5            | kB/296     | kB       | 6%]           | 58.7          | kB/s        | 7s\n56%       | [3       | gnokii-cli | 71.9          | kB/296        | kB   | 24%]          |     58.7 | kB/s     | 6s\n63%       | [3            | gnokii-cli | 132           | kB/296   | kB     | 45%]          | 58.7      | kB/s  | 5s\n68%                              | [3              | gnokii-cli | 176           | kB/296               | kB   | 59%]          |     58.7 | kB/s    | 4s\n71%       | [3        | gnokii-cli | 198           | kB/296   | kB                                   | 67%]                                 | 58.7            | kB/s   | 4s\n80%              | [3                   | gnokii-cli | 274           | kB/296   | kB  | 93%]          |     58.7 | kB/s | 2s\n82%        | [Working] | 58.7 |   kB/s | 2s    | Get:4 | http://uk.archive.ubuntu.com/ubuntu/ | trusty/universe | xgnokii     | amd64 | 0.6.31+dfsg-2ubuntu1 | [151 | kB] |
| 82%        | [4                                      | xgnokii                | 0                                              | B/151                           | kB             | 0%]             | 58.7                                 | kB/s            | 2s\n84%         | [4            | xgnokii              | 18.5            | kB/151     | kB       | 12%]          | 58.7          | kB/s        | 2s\n90%       | [4       | xgnokii    | 65.0          | kB/151        | kB   | 43%]          |     58.7 | kB/s     | 1s\n94%       | [4            | xgnokii    | 101           | kB/151   | kB     | 67%]          | 58.7      | kB/s  | 0s\n99%                              | [4              | xgnokii    | 140           | kB/151               | kB   | 93%]          |     76.2 | kB/s    | 0s\n100%      | [Working] | 76.2       | kB/s          | 0s       | Get:5                                | http://uk.archive.ubuntu.com/ubuntu/ | trusty/universe | gnokii | all                  | 0.6.31+dfsg-2ubuntu1 | [930       | B]            |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| 100%       | [5                                      | gnokii                 | 0                                              | B/930                           | B              | 0%]             | 76.2                                 | kB/s            | 0s\n100%        | [Working]     | 76.2                 | kB/s            | 0s         | Fetched  | 851           | kB            | in          | 12s           | (66.1    | kB/s)      |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Selecting  | previously                              | unselected             | package                                        | gnokii-common.                  |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| (Reading   | database                                | ...                    | (Reading                                       | database                        | ...            | 5%\n(Reading    | database                             | ...             | 10%\n(Reading   | database      | ...                  | 15%\n(Reading   | database   | ...      | 20%\n(Reading | database      | ...         | 25%\n(Reading | database | ...        | 30%\n(Reading | database      | ...  | 35%\n(Reading | database | ...      | 40%\n(Reading | database      | ...        | 45%\n(Reading | database | ...    | 50%\n(Reading | database  | ...   | 55%\n(Reading                        | database        | ...        | 60%\n(Reading | database             | ...  | 65%\n(Reading | database | ...     | 70%\n(Reading | database  | ...        | 75%\n(Reading | database | ...                                  | 80%\n(Reading                        | database        | ...    | 85%\n(Reading        | database             | ...        | 90%\n(Reading | database | ... | 95%\n(Reading | database | ...  | 100%\n(Reading | database  |  ... | 207012 | files | and   | directories                          | currently       | installed.) |       |                      |      |     |
| Preparing  | to                                      | unpack                 | .../gnokii-common_0.6.31+dfsg-2ubuntu1_all.deb | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Unpacking  | gnokii-common                           | (0.6.31+dfsg-2ubuntu1) | ...                                            |                                 |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Selecting  | previously                              | unselected             | package                                        | libgnokii7.                     |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Preparing  | to                                      | unpack                 | .../libgnokii7_0.6.31+dfsg-2ubuntu1_amd64.deb  | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Unpacking  | libgnokii7                              | (0.6.31+dfsg-2ubuntu1) | ...                                            |                                 |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Selecting  | previously                              | unselected             | package                                        | gnokii-cli.                     |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Preparing  | to                                      | unpack                 | .../gnokii-cli_0.6.31+dfsg-2ubuntu1_amd64.deb  | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Unpacking  | gnokii-cli                              | (0.6.31+dfsg-2ubuntu1) | ...                                            |                                 |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Selecting  | previously                              | unselected             | package                                        | xgnokii.                        |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Preparing  | to                                      | unpack                 | .../xgnokii_0.6.31+dfsg-2ubuntu1_amd64.deb     | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Unpacking  | xgnokii                                 | (0.6.31+dfsg-2ubuntu1) | ...                                            |                                 |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Selecting  | previously                              | unselected             | package                                        | gnokii.                         |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Preparing  | to                                      | unpack                 | .../gnokii_0.6.31+dfsg-2ubuntu1_all.deb        | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Unpacking  | gnokii                                  | (0.6.31+dfsg-2ubuntu1) | ...                                            |                                 |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Processing | triggers                                | for                    | man-db                                         | (2.6.7.1-1)                     | ...            |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| debconf:   | unable                                  | to                     | initialize                                     | frontend:                       | Dialog         |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| debconf:   | (Dialog                                 | frontend               | will                                           | not                             | work           | on              | a                                    | dumb            | terminal,       | an            | emacs                | shell           | buffer,    | or       | without       | a             | controlling | terminal.)    |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| debconf:   | falling                                 | back                   | to                                             | frontend:                       | Readline       |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Processing | triggers                                | for                    | gnome-menus                                    | (3.10.1-0ubuntu2)               | ...            |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Processing | triggers                                | for                    | desktop-file-utils                             | (0.22-1ubuntu1)                 | ...            |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Processing | triggers                                | for                    | bamfdaemon                                     | (0.5.1+14.04.20140409-0ubuntu1) | ...            |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Rebuilding | /usr/share/applications/bamf-2.index... |                        |                                                |                                 |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Processing | triggers                                | for                    | mime-support                                   | (3.54ubuntu1)                   | ...            |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Setting    | up                                      | gnokii-common          | (0.6.31+dfsg-2ubuntu1)                         | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Setting    | up                                      | libgnokii7             | (0.6.31+dfsg-2ubuntu1)                         | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Setting    | up                                      | gnokii-cli             | (0.6.31+dfsg-2ubuntu1)                         | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Adding     | group                                   | `gnokii'               | (GID                                           | 125)                            | ...            |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Done.      |                                         |                        |                                                |                                 |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Setting    | up                                      | xgnokii                | (0.6.31+dfsg-2ubuntu1)                         | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Setting    | up                                      | gnokii                 | (0.6.31+dfsg-2ubuntu1)                         | ...                             |                |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
| Processing | triggers                                | for                    | libc-bin                                       | (2.19-0ubuntu6)                 | ...            |                 |                                      |                 |                 |               |                      |                 |            |          |               |               |             |               |          |            |               |               |      |               |          |          |               |               |            |               |          |        |               |           |       |                                      |                 |            |               |                      |      |               |          |         |               |           |            |               |          |                                      |                                      |                 |        |                      |                      |            |               |          |     |               |          |      |                |           |      |        |       |       |                                      |                 |             |       |                      |      |     |
***** Test
#+BEGIN_SRC sh
ls /etc/gnokiirc
#+END_SRC

#+RESULTS:

https://wiki.archlinux.org/index.php/USB_3G_Modem
#+BEGIN_SRC sh
gnokii --getsms SM 0 end 2>&1|grep Text -A1 -B3|grep -v Text
#+END_SRC

#+RESULTS:

**** Send USSD
#+BEGIN_SRC sh :dir /sudo::
asterisk -rx "dongle ussd dongle0 *152#"
#+END_SRC

#+RESULTS:
: [dongle0] USSD queued for send with id 0x7f7f70000f20

- [dongle0] Error parsing incoming message '+CMGR: 0,,130
  0791881005519999040ED0D432BB4C0FB3D70000611070612200427DC472580E9AD6C5F3B13C2D2ECB43D9771D840EDBCB209C2D7673CD62355053082286E961283BEC8ECC604761A41693ADC5F039CB1E66A7C9697A1E949E8364B098AD058BB5623296F12D07B5DFF232885CA687D3EC390BCE2E87E765D038CC668362B2988B8A0EBBD7A0FCBBEE02'
- at possition 45: Can't parse OA
#+BEGIN_SRC :var rawpdu=0791881005519999040ED0D432BB4C0FB3D70000611070612200427DC472580E9AD6C5F3B13C2D2ECB43D9771D840EDBCB209C2D7673CD62355053082286E961283BEC8ECC604761A41693ADC5F039CB1E66A7C9697A1E949E8364B098AD058BB5623296F12D07B5DFF232885CA687D3EC390BCE2E87E765D038CC668362B2988B8A0EBBD7A0FCBBEE02"
var pdu = require('pdu');
pdu.parse(rawbdu);
#+END_SRC
PDU [[http://www.gsmfavorites.com/documents/sms/pdutext/][ref]]
****** Generate
#+BEGIN_SRC
  pdu.generate({
      text:'Some text',
      receiver:999999999999, //MSISDN
      encoding:'16bit' //Or 7bit if you're sending an ascii message.
    });
#+END_SRC
***** Result Shouldbe
#+BEGIN_SRC
SMSC#+880150159999
Sender:Teletalk
TimeStamp:07/01/16 16:22:00 GMT ?
TP_PID:00
TP_DCS:00
TP_DCS-popis:Uncompressed Text
No class
Alphabet:Default

Dear Subscriber!You have 8617.315 MB DataPlan_30GB_512kbps,validity is 2016-01-12,For more details,please call 121.Thank you.
Length:125
#+END_SRC
**** E1550
https://wiki.archlinux.org/index.php/Huawei_E1550_3G_modem#USSD_Requests
* Clipboard                                                       :CLIPBOARD:
** xclip [[http://unix.stackexchange.com/questions/16694/copy-input-to-clipboard-over-ssh][unix stackexchage]]
** [[http://blog.binchen.org/?p=589][gist]]
** [[http://stackoverflow.com/questions/1152362/getting-items-on-the-local-clipboard-from-a-remote-ssh-session][pbcopy /pdppaste]]

* DONE SSH and Trump
  CLOCK: [2016-01-07 বৃহঃ 01:12]--[2016-01-07 বৃহঃ 03:12] =>  2:00
  CLOCK: [2016-01-07 বৃহঃ 01:03]--[2016-01-07 বৃহঃ 01:04] =>  0:01
  CLOCK: [2016-01-07 বৃহঃ 00:36]--[2016-01-07 বৃহঃ 01:02] =>  0:26
  :PROPERTIES:
  :Effort:   1:00
  :ORDERED:  t
  :END:
** DONE ssh connection timeout and speed
   CLOCK: [2016-01-07 বৃহঃ 00:10]--[2016-01-07 বৃহঃ 00:33] =>  0:23
   :PROPERTIES:
   :Effort:   0:25
   :END:
*** SSH client config files
:PROPERTIES:
:dir: /sudo:root@localhost:/etc/ssh/
:END:
**** List config files
#+BEGIN_SRC sh
ls
#+END_SRC

#+RESULTS:
| moduli      |
| ssh_config  |
| ssh_config~ |
**** Show Change config
#+BEGIN_SRC sh
tail -2 ssh_config
#+END_SRC

#+RESULTS:
| GSSAPIAuthentication      | yes |
| GSSAPIDelegateCredentials | no  |
**** [[http://www.anchor.com.au/blog/2010/02/ssh-controlmaster-the-good-the-bad-the-ugly/][SSH ControlMaster]]: The Good, The Bad, The Ugly
On some trivial benchmarking I did when validating ControlMaster for our use, I found that we were saving nearly 2.5 seconds per connection — a drop from 3.3 seconds to 0.8. Mighty convenient.
It’s simple to use, too.
If you just want to enable “opportunistic” multiplexing,
***** Prepare Git
#+BEGIN_SRC sh
mkdir /home/rks/org/ssh
cp ssh_config /home/rks/org/ssh
ls /home/rks/org/ssh
#+END_SRC

#+RESULTS:
: ssh_config
***** you can do something as simple as this in your SSH config
***** Add ServerAliveInterval
#+BEGIN_EXAMPLE
Host *
ControlMaster auto
ControlPath ~/.ssh/cm_socket/%r@%h:%p
ServerAliveInterval 5
#+END_EXAMPLE

***** Apply config
#+BEGIN_SRC sh
cp /home/rks/org/ssh/ssh_config .
#+END_SRC

#+RESULTS:

** DONE Check Update Manually (error) affer ssh config
   :PROPERTIES:
   :Effort:   2:31
   :END:
muxserver_listen bind(): No such file or directory
*** Fix by Add dirctory
#+BEGIN_SRC sh
mkdir ~/.ssh/cm_socket
ls ~/.ssh/
#+END_SRC

#+RESULTS:
| cm_socket   |
| config      |
| id_rsa      |
| id_rsa.pub  |
| known_hosts |

** DONE Remote Session
:PROPERTIES:
:session: myserversession
:results: output
:dir: /ssh:asik@23.227.183.105|su:root@23.227.183.105:
:END:
*** Issue - Tramp mode always hangs after sleep
hold down C-g until you get prompt back, then
M-x tramp-cleanup-all-connections
*** Add A User that only have own home directory access
**** check rbash
#+BEGIN_SRC sh
which rbash
#+END_SRC

#+RESULTS:
: /bin/rbash
**** add a group
#+BEGIN_SRC sh
groupadd kmtm
#+END_SRC

#+RESULTS:

**** Add test user "king" with rbash added
#+BEGIN_SRC sh
useradd -s /bin/rbash -m -d /home/king -c "LeBron James" -g kmtm king
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sh
  cat /etc/passwd | grep king
#+END_SRC

#+RESULTS:
: king:x:1002:1002:LeBron James:/home/king:/bin/rbash
**** Add passwd to king
#+BEGIN_SRC sh
passwd king
#+END_SRC

#+RESULTS:
: Enter new UNIX password:
: Retype new UNIX password:
: passwd: password updated successfully

** DONE Access New user king
:PROPERTIES:
:session: kingsession
:dir: /ssh:asik@23.227.183.105|su:king@23.227.183.105:
:END:
*** test access rights
#+NAME: kings_home
#+BEGIN_SRC sh
pwd
#+END_SRC

#+RESULTS:
: /home/king

*** SSH Key
   CLOCK: [2016-01-07 বৃহঃ 01:04]--[2016-01-07 বৃহঃ 02:04] =>  1:00
   CLOCK: [2016-01-07 বৃহঃ 01:04]--[2016-01-07 বৃহঃ 01:04] =>  0:00
   :PROPERTIES:
   :Effort:   0:15
   :END:
#+NAME: genssh
#+BEGIN_SRC sh :var directory="~"
 ssh-keygen -b 2048 -t rsa -f $directory/.ssh/id_rsa -q -N ""
 ls  $directory/.ssh/id_rsa.pub
#ls -l
#+END_SRC
#+RESULTS:
| -rw------- | 1 | king | kmtm | 1679 | Jan | 6 | 15:42 | .ssh/id_rsa     |
| -rw-r--r-- | 1 | king | kmtm |  395 | Jan | 6 | 15:42 | .ssh/id_rsa.pub |
#+NAME: kings_rsapub
#+BEGIN_SRC sh
cat .ssh/id_rsa.pub
#+END_SRC

#+RESULTS: king_rsapub
: ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCjQhJ+iRkyR0LzZ9nLfXIYAWHMvzoy6Kab2bt2tbwipNQONOcNFdkMc+LxwugeAAIxAkmPi7fsyC0Z41gS/fIJwD6qmlDkYIMzXCHL8MX0CFeEB0+PEk0q7rNU88sChFbiCMk1U7wHWRwny747+U5bxm+F34p1AwoSTJ1iHWV4JrFQUbiQxl0KlrtpdcHtIXRUQ/GwGbx33MKFUa8sTZwJe3qp1qoo8S8/3mC0roaiGg3PZrdTVER0WUS225jk+AXpyPpYLW+dmIbtwOHIxmC8FZOmL5aQUkn5YvMWgCaY1hxvw6lv7b5fEuorFxmlbOtdHejBswzyNQ9kdy1hhHiD king@asik-105

** DONE Add Key to Local user
#+BEGIN_SRC sh :var getpub=kings_rsapub[0]
cat $getpub
#+END_SRC

#+RESULTS:
: ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCjQhJ+iRkyR0LzZ9nLfXIYAWHMvzoy6Kab2bt2tbwipNQONOcNFdkMc+LxwugeAAIxAkmPi7fsyC0Z41gS/fIJwD6qmlDkYIMzXCHL8MX0CFeEB0+PEk0q7rNU88sChFbiCMk1U7wHWRwny747+U5bxm+F34p1AwoSTJ1iHWV4JrFQUbiQxl0KlrtpdcHtIXRUQ/GwGbx33MKFUa8sTZwJe3qp1qoo8S8/3mC0roaiGg3PZrdTVER0WUS225jk+AXpyPpYLW+dmIbtwOHIxmC8FZOmL5aQUkn5YvMWgCaY1hxvw6lv7b5fEuorFxmlbOtdHejBswzyNQ9kdy1hhHiD king@asik-105

** Can I automatically add a new host to known_hosts?
*** Local User
using key-scan would be the right & unobtrusive way to do it.
#+NAME: addhost
#+BEGIN_SRC sh :var HOST="" :port cat()
ssh-keyscan -t rsa,dsa $HOST 2>&1 | sort -u - ~/.ssh/known_hosts > ~/.ssh/tmp_hosts
mv ~/.ssh/tmp_hosts ~/.ssh/known_hosts
#+END_SRC

#+RESULTS:

#+NAME: cat
#+BEGIN_SRC elisp :var file="" :results raw
  (defun file-string(file)
  "Read The contents of a file and return as a string"
  (with-temp-buffer
    (insert-file-contents file)
    (buffer-string)))
  (file-string file)
#+END_SRC

#+CALL: cat(file="~/.ssh/known_hosts")

#+RESULTS:
: |1|nXs/N8obLU82gHkqnGwz4iaRhkE=|MDbH4Dco4cF33EVXYnhrApfK4Aw= ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBJPC90h60hJjS5N+tHw0Fe1g5jgfoMxxXzqPbYxITFrBH3diZnfTTR6dKE8HB6r0PiV1lUcwwNfZ6UESXpwp5hw=
: # github.com SSH-2.0-libssh-0.7.0
: github.com ssh-dss AAAAB3NzaC1kc3MAAACBANGFW2P9xlGU3zWrymJgI/lKo//ZW2WfVtmbsUZJ5uyKArtlQOT2+WRhcg4979aFxgKdcsqAYW3/LS1T2km3jYW/vr4Uzn+dXWODVk5VlUiZ1HFOHf6s6ITcZvjvdbp6ZbpM+DuJT7Bw+h5Fx8Qt8I16oCZYmAPJRtu46o9C2zk1AAAAFQC4gdFGcSbp5Gr0Wd5Ay/jtcldMewAAAIATTgn4sY4Nem/FQE+XJlyUQptPWMem5fwOcWtSXiTKaaN0lkk2p2snz+EJvAGXGq9dTSWHyLJSM2W6ZdQDqWJ1k+cL8CARAqL+UMwF84CR0m3hj+wtVGD/J4G5kW2DBAf4/bqzP4469lT+dF2FRQ2L9JKXrCWcnhMtJUvua8dvnwAAAIB6C4nQfAA7x8oLta6tT+oCk2WQcydNsyugE8vLrHlogoWEicla6cWPk7oXSspbzUcfkjN3Qa6e74PhRkc7JdSdAlFzU3m7LMkXo1MHgkqNX8glxWNVqBSc0YRdbFdTkL0C6gtpklilhvuHQCdbgB3LBAikcRkDp+FCVkUgPC/7Rw==
: github.com ssh-rsa AAAAB3NzaC1yc2EAAAABIwAAAQEAq2A7hRGmdnm9tUDbO9IDSwBK6TbQa+PXYPCPy6rbTrTtw7PHkccKrpp0yVhp5HdEIcKr6pLlVDBfOLX9QUsyCOV0wzfjIJNlGEYsdlLJizHhbn2mUjvSAHQqZETYP81eFzLQNnPHt4EVVUh7VfDESU84KezmD5QlWpXLmvU31/yMf+Se8xhHTvKSCZIFImWwoG6mbUoWf9nzpIoaSjB+weqqUUmpaaasXVal72J+UX2B+2RPW3RcT0eOzQgqlJL3RKrTJvdsjE3JEAvGq3lGHSZXy28G3skua2SmVi/w4yCE6gbODqnTWlg7+wC604ydGXA8VJiS5ap43JXiUFFAaQ==

*** Root Users
:PROPERTIES:
:dir: /su:root@localhost:
:END:
#+NAME: hello
#+BEGIN_SRC sh
ls -l ~/
#+END_SRC

#+RESULTS: hello
: total 0

* Install PPP
** DONE Check IP Address
#+BEGIN_SRC sh :results verbatim
ifconfig eth0
#+END_SRC

#+RESULTS:
: eth0      Link encap:Ethernet  HWaddr 00:1c:c0:63:7c:7d
:           inet6 addr: fe80::21c:c0ff:fe63:7c7d/64 Scope:Link
:           UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1
:           RX packets:448 errors:0 dropped:2 overruns:0 frame:0
:           TX packets:261 errors:0 dropped:0 overruns:0 carrier:0
:           collisions:0 txqueuelen:1000
:           RX bytes:106494 (106.4 KB)  TX bytes:47782 (47.7 KB)
:

** DONE Check PPPD exist
#+BEGIN_SRC sh
which pppd
#+END_SRC

#+RESULTS:
: /usr/sbin/pppd

#+BEGIN_SRC
/etc/ppp/peers/your_provider
plugin rp-pppoe.so
# rp_pppoe_ac 'your ac name'
# rp_pppoe_service 'your service name'

# network interface
eth0
# login name
name "someloginname"
usepeerdns
persist
# Uncomment this if you want to enable dial on demand
#demand
#idle 180
defaultroute
hide-password
noauth
#+END_SRC

** ppp configaration file
:PROPERTIES:
:dir: /su:root@localhost:/etc/ppp/peers/ispdh
:END:

#+BEGIN_EXAMPLE
plugin rp-pppoe.so
# rp_pppoe_ac 'your ac name'
# rp_pppoe_service 'your service name'

# network interface
eth0
# login name
name "mdohs92"
usepeerdns
persist
# Uncomment this if you want to enable dial on demand
#demand
#idle 180
defaultroute
hide-password
noauth
#+END_EXAMPLE

#+BEGIN_EXAMPLE

#+END_EXAMPLE
** ppp password
:PROPERTIES:
:dir: /su:root@localhost:/etc/ppp/peers/pap-secrets
:END:
#+BEGIN_EXAMPLE
mdohs92 * 3088
#+END_EXAMPLE
** Start Link
#+BEGIN_SRC sh
pppd call ispd
#+END_SRC
* DONE eccential python install
  CLOSED: [2016-01-03 রবি 06:48]
#+BEGIN_SRC sh :dir /sudo::
  #sudo apt-get install python-pip python-dev build-essential
  sudo pip install --upgrade pip
  sudo pip install --upgrade virtualenv
#+END_SRC

#+RESULTS:

* chrome shortcuts
*** [[http://www.getsidekick.com/blog/chrome-keyboard-shortcuts][25 shortcuts links]]
*** Manage Tabs
**** DONE [[http://www.shortcutworld.com/en/linux/Chrome.html][shortcutls.com]]
***** DONE Ctrl+TOpen new tab
***** DONE Ctrl+W/Ctrl+F4Close tab (or close Chrome if only one tab is open)
***** DONE Ctrl+Shift+TReopen last tab closed. Up to 10 tabs.
***** DONE Ctrl+1 through Ctrl+8Jump to first tab, second tab, etc.
***** DONE Ctrl+9Switch to the last tab
***** DONE Ctrl+Tab/Ctrl+Shift+TabSwitch to the next / previous tab
***** DONE (or use ctrl+page up/ctrl+page down)
***** DONE Ctrl+NOpen new Chrome window
***** DONE Ctrl+Shift+NOpen new Chrome window in incognito mode
***** DONE Alt+F4Close current window
***** DONE Ctrl and click on linkOpen link in a new background tab
***** DONE Shift+ctrl and click on linkOpen link in a new foreground tab
***** DONE Shift and click on linkOpen link in a new window
***** DONE Alt and click on linkDownload link
***** DONE Drag link to existing tabOpen link in selected tab
***** DONE Drag link to tab barOpen link in a new tab in the specified position on the tab

**** Address Bar
***** Alt+D/Ctrl+LJump to address bar; highlights current webpage URI if available
***** Ctrl+EEnter search query in address bar
***** Home/End in address barJump to beginning / end of address bar
***** Ctrl+a in address barSelect all text of address. Also use shift+end with cursor at beginning or shift+home with cursor at end
***** Type name of site and press Ctrl+EnterAdd www. to beginning and .com to end of input and opens the web address in current tab.
***** Type name of site and press Alt+EnterAdd www. to beginning and .com to end of input and opens the web address in new background tab.
***** Type search term and press EnterPerform a search using the search engine associated with the keyword or the URI.
* Arch Installation
** check partitions
#+BEGIN_SRC sh
lsblk
#+END_SRC
or
#+BEGIN_SRC sh
fdisk -l
#+END_SRC
** chreate parti
#+BEGIN_SRC sh
cfdisk /dev/sd*
#+END_SRC
** mount partitions
*** Primary
#+BEGIN_SRC sh
mkfs.ext4 /dev/sda1
mount /dev/sda1 /mnt
#+END_SRC
*** Swap
#+BEGIN_SRC sh
mkswap /dev/sdb1
swapon /dev/sdb1
#+END_SRC
** Installation
#+BEGIN_SRC sh
pacstrap /mnt base base-devel xorg xorg-server xorg-server-utils xorg-apps xorg-xinit xorg-message xscreensaver feh ttf-inconsolata xmonad xmonad-contrib ghc cabal-install xmobar haddock gmrun dmenu
#+END_SRC
* Virtual
** Virtual box in ubuntu
#+BEGIN_SRC
sudo sh -c "echo 'deb http://download.virtualbox.org/virtualbox/debian '$(lsb_release -cs)' contrib non-free' > /etc/apt/sources.list.d/virtualbox.list" && wget -q http://download.virtualbox.org/virtualbox/debian/oracle_vbox.asc -O- | sudo apt-key add - && sudo apt-get update && sudo apt-get install virtualbox-5.0
#+END_SRC
* Install Pandoc
#+call: cmdaync("apt-get install haskell-platform haskell-platform-doc")
#+call: cmdaync("cabal update && cabal install cabal-install ")
#+call: cmdaync("cabal install ghc-mod hoogle hlint pointfree")
#+call: cmdaync("cabal install pandoc")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha

#+call: cmdaync("find / -name  pandoc\\*")

#+BEGIN_SRC sh
ls -l
#+END_SRC
* Install PDF tools for emacs
** Installation of Dependencies
#+NAME: pdftools
#+BEGIN_EXAMPLE
 sudo apt-get install libpng-dev libz-dev  ;
 sudo apt-get install libpoppler-glib-dev ;
 sudo apt-get install libpoppler-private-dev
#+END_EXAMPLE
#+call: cmdaync(pdftools)

#+RESULTS:
: command  is sended to /tmp/org

#+NAME: imagemagic
#+BEGIN_EXAMPLE
sudo apt-get install imagemagick
#+END_EXAMPLE
#+call: cmdaync(imagemagic)

#+RESULTS:
: command  is sended to /tmp/org

#+NAME: wpdf
#+BEGIN_EXAMPLE
sudo apt-get install wkhtmltopdf
#+END_EXAMPLE
#+call: cmdaync(wpdf)

#+RESULTS:
: command  is sended to /tmp/org
